Project/Toir/src/DataProcessors/торо_ЗакрытиеЗаявокИРемонтов/торо_ЗакрытиеЗаявокИРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_ЗакрытиеЗаявокИРемонтов</name>
  <attributes>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗакрываемыеРемонты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьЗаявка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Перенесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоваяДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обрабатывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗакрытия</name>
      <type>
        <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>Цепочка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ЗакрытиеЗаявокИРемонтов</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрытьЗаявку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗакрытияЗаявки</name>
      <type>
        <types>CatalogRef.торо_ПричиныЗакрытияЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>РемонтВключенВОбщийПлан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АварийныеРемонты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьЗаявка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обрабатывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗакрытия</name>
      <type>
        <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОбнаружения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрытьЗаявку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗакрытияЗаявки</name>
      <type>
        <types>CatalogRef.торо_ПричиныЗакрытияЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>РемонтВключенВОбщийПлан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Project/Toir/src/InformationRegisters/торо_ЗаявкиПоРемонтам/торо_ЗаявкиПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗаявкиПоРемонтам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УточнениеИсполнителя</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.торо_РемонтныеБригады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_НарядыПоРемонтам/торо_НарядыПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НарядыПоРемонтам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_АктыПоРемонтам/торо_АктыПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_АктыПоРемонтам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВыявленныеДефекты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДефектПричина</name>
    <type>
      <types>CatalogRef.торо_ПричиныДефектов</types>
    </type>
  </resources>
  <resources>
    <name>ДефектВыявленВПроцессе</name>
    <type>
      <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </resources>
  <resources>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>КритичностьДефекта</name>
    <type>
      <types>CatalogRef.торо_КритичностьДефекта</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ДефектОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаправлениеНаУстранение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>гкс_СимптомДефекта</name>
    <type>
      <types>CatalogRef.гкс_СимптомыДефектов</types>
    </type>
  </resources>
  <resources>
    <name>гкс_КорневаяПричина</name>
    <type>
      <types>CatalogRef.гкс_КорневыеПричины</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтказавшийЭлемент</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОтмененныеРемонты/торо_ОтмененныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОтмененныеРемонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ВнешниеОснованияДляРабот/торо_ВнешниеОснованияДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВнешниеОснованияДляРабот</name>
  <comment> //TOIR20-370: включенно индексирование для ID и ПлановаяДатаРемонта</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>гкс_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РемонтыОборудования_id</name>
    <comment>Не используется! РемонтыОборудования_ID искать в измерении ID</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <comment>Содержит РемонтыОборудования_ID, несмотря на реквизит</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОтмененныеЗаявки/торо_ОтмененныеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОтмененныеЗаявки</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>CatalogRef.торо_ПричиныЗакрытияЗаявок</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/торо_ПричиныЗакрытияЗаявок/торо_ПричиныЗакрытияЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ПричиныЗакрытияЗаявок</name>
  <predefined>
    <items>
      <name>ОшибкаВЗаявке</name>
      <description>Заявка введена ошибочно</description>
    </items>
    <items>
      <name>ОтменаРемонта</name>
      <description>Отмена ремонта</description>
    </items>
    <items>
      <name>ПереносРемонта</name>
      <description>Перенос ремонта</description>
    </items>
  </predefined>
</mdclass:Catalog>

Project/Toir/src/DataProcessors/торо_ЗакрытиеЗаявокИРемонтов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДатаАктуальности") Тогда
		Объект.ДатаАктуальности = Параметры.ДатаАктуальности;
	Иначе
		Объект.ДатаАктуальности = ТекущаяДата();
	КонецЕсли; 
	                                           
	Если Параметры.Свойство("Владелец") Тогда
		Владелец = Параметры.Владелец;
	КонецЕсли;
	
	Если Параметры.Свойство("ДоступностьКнопкиЗаполнить") Тогда
		Элементы.ЗакрываемыеРемонтыЗаполнитьПлановыеРемонты.Доступность = Параметры.ДоступностьКнопкиЗаполнить;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗакрываемыеРемонты") Тогда
		
		Для каждого Стр Из Параметры.ЗакрываемыеРемонты Цикл
			
			НС = Объект.ЗакрываемыеРемонты.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
			
		КонецЦикла;
		
	Иначе
		
		Если Параметры.Свойство("ОтборРемонтов") Тогда
			ЗаполнитьПлановыеРемонтыНаСервере(Параметры.ОтборРемонтов.ID);
			ЗаполнитьАварийныеРемонтыНаСервере(Параметры.ОтборРемонтов.ID);
			
			Элементы.АварийныеРемонты.ОтборСтрок = Новый ФиксированнаяСтруктура("ПодходитПодОтбор", Истина);
			Элементы.ЗакрываемыеРемонты.ОтборСтрок = Новый ФиксированнаяСтруктура("ПодходитПодОтбор", Истина);
		Иначе
			ЗаполнитьПлановыеРемонтыНаСервере();
			ЗаполнитьАварийныеРемонтыНаСервере();
		КонецЕсли;
		
	КонецЕсли;
	
	ФОИспользоватьППР = ПолучитьФункциональнуюОпцию("торо_ИспользоватьППР");
	ФОИспользоватьВД = ПолучитьФункциональнуюОпцию("торо_УчетВыявленныхДефектовОборудования");
	
	ПричинаЗакрытияЗаявок = Константы.торо_ПричинаЗакрытияЗаявок.Получить();
	
	Элементы.ГруппаЗакрываемыеРемонты.Видимость = ФОИспользоватьППР;
	Элементы.ГруппаАварийныеРемонты.Видимость = ФОИспользоватьВД;
	
КонецПроцедуры  
 
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗакрываемыеРемонты
&НаКлиенте
Процедура ЗакрываемыеРемонтыПередНачаломИзменения(Элемент, Отказ)
	Если Элементы.ЗакрываемыеРемонты.ТекущийЭлемент.Имя <> "ЗакрываемыеРемонтыОбрабатывать" Тогда
		Если Не Элементы.ЗакрываемыеРемонты.ТекущиеДанные.Обрабатывать Тогда 
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрываемыеРемонтыОтмененПриИзменении(Элемент)
	ТекСтрока = Элементы.ЗакрываемыеРемонты.ТекущиеДанные;
	Если ТекСтрока.Отменен И ТекСтрока.Перенесен Тогда
		ТекСтрока.Перенесен = Ложь;
	КонецЕсли;
	ЗакрытиеЗаявки(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрываемыеРемонтыПеренесенПриИзменении(Элемент)
	ТекСтрока = Элементы.ЗакрываемыеРемонты.ТекущиеДанные;
	Если ТекСтрока.Перенесен И ТекСтрока.Отменен Тогда
		ТекСтрока.Отменен = Ложь;
	КонецЕсли;
	ЗакрытиеЗаявки(ТекСтрока);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАварийныеРемонты
&НаКлиенте
Процедура АварийныеРемонтыПередНачаломИзменения(Элемент, Отказ)
	Если Элементы.АварийныеРемонты.ТекущийЭлемент.Имя <> "АварийныеРемонтыОбрабатывать" Тогда
		Если Не Элементы.АварийныеРемонты.ТекущиеДанные.Обрабатывать Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АварийныеРемонтыОтмененПриИзменении(Элемент)
	ТекСтрока = Элементы.АварийныеРемонты.ТекущиеДанные;
	ЗакрытиеЗаявки(ТекСтрока);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	
	отказ = ВыполнитьОбработкуНаСервере();
		
	ПричиныНеЗаполнены = Ложь;
	Для Каждого Строка Из ОбрабатываемыеСтроки Цикл
		Если ((Строка.Отменен ИЛИ Строка.Перенесен) И НЕ ЗначениеЗаполнено(Строка.ПричинаЗакрытия))
			ИЛИ (Строка.ЗакрытьЗаявку И НЕ ЗначениеЗаполнено(Строка.ПричинаЗакрытияЗаявки)) Тогда
			Если ЗначениеЗаполнено(Владелец) Тогда
				ПоказатьПредупреждение(Неопределено,НСтр("es='No para todas las reparaciones cerradas (los Presupuestos de la reparación (¡las Demandas por la reparación) es indicada la Causa del cierre! ¡El tratamiento no es cumplido!';ru='Не для всех закрываемых ремонтов (Смет ремонта(Заявок на ремонт) указана Причина закрытия! Обработка не выполнена!';en='Not for all repairs to be closed (Repair estimates (Repair requests), the reason for closing is indicated! Processing failed!'"));
			Иначе
				ТекстСообщения = НСтр("es='No para todas las reparaciones cerradas (los Presupuestos de la reparación (¡las Demandas por la reparación) es indicada la Causa del cierre! ¡El tratamiento no es cumplido!';ru='Не для всех закрываемых ремонтов (Смет ремонта(Заявок на ремонт) указана Причина закрытия! Обработка не выполнена!';en='Not for all repairs to be closed (Repair estimates (Repair requests), the reason for closing is indicated! Processing failed!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
			ПричиныНеЗаполнены = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если отказ или ПричиныНеЗаполнены Тогда
		Возврат;
	КонецЕсли;
	
	МассивНезаполненныхСтрок = ОбрабатываемыеСтроки.НайтиСтроки(Новый Структура("Обрабатывать, Отменен, Перенесен, ЗакрытьЗаявку", Истина, Ложь, Ложь, Ложь));
	Если МассивНезаполненныхСтрок.Количество()>0 Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьОбработкуЗавершение", ЭтотОбъект, Новый Структура("МассивНезаполненныхСтрок", МассивНезаполненныхСтрок)), НСтр("es='No para todas las líneas tratadas es indicado el tipo del tratamiento de la reparación (es anulado o llevado) o la demanda. ¿Da lo mismo cumplir el tratamiento?';ru='Не для всех обрабатываемых строк указан вид обработки ремонта (отменен или перенесен) или заявки. Все равно выполнить обработку?';en='Not all processed lines indicate the type of repair processing (canceled or rescheduled) or application. Do the processing anyway?'"), РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	// Выполняем создание нового документа торо_ЗакрытиеЗаявокИРемонтов.
	ВыполнитьОбработкуФрагмент(МассивНезаполненныхСтрок);
	
	Оповестить("ЗакрытиеЗаявокИРемонтов", Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлановыеРемонты(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаАктуальности) Тогда
		ТекстСообщения = НСтр("es='¡Es imposible rellenar la parte tabular, porque no es rellenada la fecha de la actualidad!';ru='Невозможно заполнить табличную часть, т.к. не заполнена дата актуальности!';en='Unable to fill in the table part, the date of relevance is not filled!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПлановыеРемонтыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАварийныеРемонты(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаАктуальности) Тогда
		ТекстСообщения = НСтр("es='¡Es imposible rellenar la parte tabular, porque no es rellenada la fecha de la actualidad!';ru='Невозможно заполнить табличную часть, т.к. не заполнена дата актуальности!';en='Unable to fill in the table part, the date of relevance is not filled!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьАварийныеРемонтыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеПлановые(Команда)
	Для каждого Стр Из Объект.ЗакрываемыеРемонты Цикл
	
		Стр.Обрабатывать = Истина;
	
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеПлановые(Команда)
	Для каждого Стр Из Объект.ЗакрываемыеРемонты Цикл
	
		Стр.Обрабатывать = Ложь;
	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеАварийные(Команда)
	Для каждого Стр Из Объект.АварийныеРемонты Цикл
	
		Стр.Обрабатывать = Истина;
	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеАварийные(Команда)
	Для каждого Стр Из Объект.АварийныеРемонты Цикл
	
		Стр.Обрабатывать = Ложь;
	
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьАварийныеРемонтыНаСервере(ОтборРемонтов = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РемонтыЗаявок.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ РемонтыСАктамиНарядами
	               |ИЗ
	               |	РегистрСведений.торо_ЗаявкиПоРемонтам КАК РемонтыЗаявок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
	               |		ПО РемонтыЗаявок.IDРемонта = торо_НарядыПоРемонтам.IDРемонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
	               |		ПО РемонтыЗаявок.IDРемонта = торо_АктыПоРемонтам.IDРемонта
	               |ГДЕ
	               |	НЕ(торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	               |				И торо_АктыПоРемонтам.IDРемонта ЕСТЬ NULL)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	торо_ЗаявкиПоРемонтам.IDРемонта КАК ID,
	               |	РемонтыСАктамиНарядами.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ РемонтыЗаявокСАктамиНарядами
	               |ИЗ
	               |	РемонтыСАктамиНарядами КАК РемонтыСАктамиНарядами
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК торо_ЗаявкиПоРемонтам
	               |		ПО РемонтыСАктамиНарядами.Регистратор = торо_ЗаявкиПоРемонтам.Регистратор
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |"+"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                  |	торо_ВыявленныеДефекты.ID КАК ID,
	                  |	торо_ВыявленныеДефекты.Регистратор КАК Регистратор,
	                  |	торо_ВыявленныеДефекты.Период КАК Период,
	                  |	торо_ВыявленныеДефекты.ОтказавшийЭлемент КАК ОбъектРемонта
	                  |ПОМЕСТИТЬ РемонтыПлановыеИДефекты
	                  |ИЗ
	                  |	РегистрСведений.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонты
	                  |		ПО торо_ВыявленныеДефекты.ID = торо_ОтмененныеРемонты.ID
	                  |			И (торо_ОтмененныеРемонты.Отменен)
	                  |ГДЕ
	                  |	торо_ОтмененныеРемонты.ID ЕСТЬ NULL
	                  |
	                  |ОБЪЕДИНИТЬ ВСЕ
	                  |
	                  |ВЫБРАТЬ 
	                  |	ДокВО.ID,
	                  |	ДокВО.Регистратор,
	                  |	ДокВО.Период,
	                  |	ДокВО.ОбъектРемонта
	                  |ИЗ
	                  |	РегистрСведений.торо_ВнешниеОснованияДляРабот.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот) КАК ДокВО
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонты
	                  |		ПО ДокВО.ID = торо_ОтмененныеРемонты.ID
	                  |			И (торо_ОтмененныеРемонты.Отменен)
	                  |ГДЕ
	                  |	торо_ОтмененныеРемонты.ID ЕСТЬ NULL
	                  |
	                  |ИНДЕКСИРОВАТЬ ПО
	                  |	ID"+"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	РемонтыПлановыеИДефекты.ID КАК ID,
	               |	РемонтыПлановыеИДефекты.Регистратор КАК Регистратор,
	               |	РемонтыПлановыеИДефекты.Период КАК Период,
	               |	РемонтыПлановыеИДефекты.ОбъектРемонта КАК ОбъектРемонта
	               |ПОМЕСТИТЬ РемонтыПлановыеСПодчиненными
	               |ИЗ
	               |	РемонтыПлановыеИДефекты КАК РемонтыПлановыеИДефекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
	               |		ПО РемонтыПлановыеИДефекты.ID = торо_НарядыПоРемонтам.IDРемонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
	               |		ПО РемонтыПлановыеИДефекты.ID = торо_АктыПоРемонтам.IDРемонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РемонтыЗаявокСАктамиНарядами КАК РемонтыЗаявокСАктамиНарядами
	               |		ПО РемонтыПлановыеИДефекты.ID = РемонтыЗаявокСАктамиНарядами.ID
	               |ГДЕ
	               |	торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	               |	И торо_АктыПоРемонтам.IDРемонта ЕСТЬ NULL
	               |	И РемонтыЗаявокСАктамиНарядами.ID ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	РемонтыПлановыеСПодчиненными.ID КАК ID,
	               |	РемонтыПлановыеСПодчиненными.ОбъектРемонта КАК ОбъектРемонта,
	               |	Константы.торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов КАК ВидРемонта,
	               |	ВЫБОР
	               |		КОГДА НЕ Заявки.Регистратор ЕСТЬ NULL
	               |				И торо_ОтмененныеЗаявки.Заявка ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЕстьЗаявка,
	               |	РемонтыПлановыеСПодчиненными.Регистратор КАК Регистратор,
	               |	Константы.торо_ОтменятьЗакрытиеЗаявок КАК Отменен,
	               |	Константы.торо_ПричинаЗакрытияРемонтов КАК ПричинаЗакрытия,
				   |	Константы.торо_ПричинаЗакрытияЗаявок КАК ПричинаЗакрытияЗаявки,
	               |	РемонтыПлановыеСПодчиненными.Регистратор КАК ДокументОснование,
	               |	РемонтыПлановыеСПодчиненными.Период КАК ДатаОбнаружения,
	               |	Заявки.Регистратор КАК Заявка
	               |ПОМЕСТИТЬ ПодготовленныеДанные
	               |ИЗ
	               |	РемонтыПлановыеСПодчиненными КАК РемонтыПлановыеСПодчиненными
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК Заявки
	               |		ПО РемонтыПлановыеСПодчиненными.ID = Заявки.IDРемонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
	               |		ПО (Заявки.Регистратор = торо_ОтмененныеЗаявки.Заявка)
	               |			И РемонтыПлановыеСПодчиненными.ID = торо_ОтмененныеЗаявки.ИДРемонта,
	               |	Константы КАК Константы
	               |ГДЕ
	               |	РемонтыПлановыеСПодчиненными.Период <= &ДатаАктуальности
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |"+"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                  |	торо_ВыявленныеДефекты.Ссылка КАК Ссылка
	                  |ПОМЕСТИТЬ ВТ_РазрешенныеДокументы
	                  |ИЗ
	                  |	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	                  |ГДЕ
	                  |	торо_ВыявленныеДефекты.Ссылка В
	                  |			(ВЫБРАТЬ
	                  |				ПодготовленныеДанные.Регистратор КАК Регистратор
	                  |			ИЗ
	                  |				ПодготовленныеДанные КАК ПодготовленныеДанные)
	                  |
	                  |ОБЪЕДИНИТЬ ВСЕ
	                  |
	                  |ВЫБРАТЬ
	                  |	торо_ЗаявкаНаРемонт.Ссылка
	                  |ИЗ
	                  |	Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	                  |ГДЕ
	                  |	торо_ЗаявкаНаРемонт.Ссылка В
	                  |			(ВЫБРАТЬ
	                  |				ПодготовленныеДанные.Регистратор КАК Регистратор
	                  |			ИЗ
	                  |				ПодготовленныеДанные КАК ПодготовленныеДанные)
	                  |
	                  |ОБЪЕДИНИТЬ ВСЕ
	                  |
	                  |ВЫБРАТЬ
	                  |	ДокВО.Ссылка
	                  |ИЗ
	                  |	Документ.торо_ВнешнееОснованиеДляРабот КАК ДокВО
	                  |ГДЕ
	                  |	ДокВО.Ссылка В
	                  |			(ВЫБРАТЬ
	                  |				ПодготовленныеДанные.Регистратор КАК Регистратор
	                  |			ИЗ
	                  |				ПодготовленныеДанные КАК ПодготовленныеДанные)
	                  |
	                  |ОБЪЕДИНИТЬ ВСЕ
	                  |
	                  |ВЫБРАТЬ
	                  |	торо_ПланГрафикРемонта.Ссылка
	                  |ИЗ
	                  |	Документ.торо_ПланГрафикРемонта КАК торо_ПланГрафикРемонта
	                  |ГДЕ
	                  |	торо_ПланГрафикРемонта.Ссылка В
	                  |			(ВЫБРАТЬ
	                  |				ПодготовленныеДанные.Регистратор КАК Регистратор
	                  |			ИЗ
	                  |				ПодготовленныеДанные КАК ПодготовленныеДанные)
	                  |
	                  |ИНДЕКСИРОВАТЬ ПО
	                  |	Ссылка"+"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПодготовленныеДанные.ID КАК ID,
	               |	ПодготовленныеДанные.ОбъектРемонта КАК ОбъектРемонта,
	               |	ПодготовленныеДанные.ВидРемонта КАК ВидРемонта,
	               |	ПодготовленныеДанные.ЕстьЗаявка КАК ЕстьЗаявка,
	               |	ПодготовленныеДанные.Регистратор КАК Регистратор,
	               |	ПодготовленныеДанные.Отменен КАК Отменен,
	               |	ПодготовленныеДанные.ПричинаЗакрытия КАК ПричинаЗакрытия,
				   |	ПодготовленныеДанные.ПричинаЗакрытияЗаявки КАК ПричинаЗакрытияЗаявки,
	               |	ПодготовленныеДанные.ДокументОснование КАК ДокументОснование,
	               |	ПодготовленныеДанные.ДатаОбнаружения КАК ДатаОбнаружения,
	               |	ВЫБОР
	               |		КОГДА ПодготовленныеДанные.ЕстьЗаявка
	               |			ТОГДА ПодготовленныеДанные.Заявка
	               |		ИНАЧЕ &ПустаяСсылкаНаЗаявку
	               |	КОНЕЦ КАК Заявка
	               |ПОМЕСТИТЬ ДанныеСДублямиРемонтов
	               |ИЗ
	               |	ПодготовленныеДанные КАК ПодготовленныеДанные
	               |ГДЕ
	               |	ПодготовленныеДанные.Регистратор В
	               |			(ВЫБРАТЬ
	               |				ВТ_РазрешенныеДокументы.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТ_РазрешенныеДокументы КАК ВТ_РазрешенныеДокументы)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_СкользящийПланРаботСрезПоследних.ID_Ремонта КАК ID_Ремонта
	               |ПОМЕСТИТЬ вт_РемонтыИзОбщегоПлана
	               |ИЗ
	               |	РегистрСведений.торо_СкользящийПланРабот.СрезПоследних(
	               |			,
	               |			ID_Ремонта В
	               |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |					ДанныеСДублямиРемонтов.ID КАК ID
	               |				ИЗ
	               |					ДанныеСДублямиРемонтов КАК ДанныеСДублямиРемонтов)) КАК торо_СкользящийПланРаботСрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID_Ремонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.ID КАК ID
	               |ПОМЕСТИТЬ ДублиРемонтов
	               |ИЗ
	               |	ДанныеСДублямиРемонтов КАК ВТ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.ID
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(ВТ.ID) > 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.ID КАК ID,
	               |	ВТ.ОбъектРемонта КАК ОбъектРемонта,
				   |	&&ОтборРемонтов КАК ПодходитПодОтбор,
	               |	ВТ.ВидРемонта КАК ВидРемонта,
	               |	ВТ.ЕстьЗаявка КАК ЕстьЗаявка,
	               |	ВТ.Регистратор КАК Регистратор,
	               |	ВТ.Отменен КАК Отменен,
	               |	ВТ.ПричинаЗакрытия КАК ПричинаЗакрытия,
				   |	ВТ.ПричинаЗакрытияЗаявки КАК ПричинаЗакрытияЗаявки,
	               |	ВТ.ДокументОснование КАК ДокументОснование,
	               |	ВТ.ДатаОбнаружения КАК ДатаОбнаружения,
	               |	ВТ.Заявка КАК Заявка,
	               |	ВЫБОР
	               |		КОГДА вт_РемонтыИзОбщегоПлана.ID_Ремонта ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК РемонтВключенВОбщийПлан
	               |ИЗ
	               |	ДанныеСДублямиРемонтов КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДублиРемонтов КАК ДублиРемонтов
	               |		ПО ВТ.ID = ДублиРемонтов.ID
	               |		ЛЕВОЕ СОЕДИНЕНИЕ вт_РемонтыИзОбщегоПлана КАК вт_РемонтыИзОбщегоПлана
	               |		ПО ВТ.ID = вт_РемонтыИзОбщегоПлана.ID_Ремонта
	               |ГДЕ
	               |	(ВТ.ЕстьЗаявка
	               |			ИЛИ ДублиРемонтов.ID ЕСТЬ NULL)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаОбнаружения";
				   
	Запрос.УстановитьПараметр("ДатаАктуальности", КонецДня(Объект.ДатаАктуальности));
	Запрос.УстановитьПараметр("ПустаяСсылкаНаЗаявку", Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка());
	
	Если Не ОтборРемонтов = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&&ОтборРемонтов", "ВЫБОР 
																   |		КОГДА ВТ.ID В (&ОтборРемонтов)
																   |			ТОГДА ИСТИНА
																   |        ИНАЧЕ ЛОЖЬ
																   |	КОНЕЦ");
		Запрос.УстановитьПараметр("ОтборРемонтов", ОтборРемонтов);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&&ОтборРемонтов", "ИСТИНА");
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Объект.АварийныеРемонты.Очистить();
	Объект.АварийныеРемонты.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлановыеРемонтыНаСервере(ОтборРемонтов = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РемонтыЗаявок.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ РемонтыСАктамиНарядами
	               |ИЗ
	               |	РегистрСведений.торо_ЗаявкиПоРемонтам КАК РемонтыЗаявок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
	               |		ПО РемонтыЗаявок.IDРемонта = торо_НарядыПоРемонтам.IDРемонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
	               |		ПО РемонтыЗаявок.IDРемонта = торо_АктыПоРемонтам.IDРемонта
	               |ГДЕ
	               |	НЕ(торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	               |				И торо_АктыПоРемонтам.IDРемонта ЕСТЬ NULL)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	торо_ЗаявкиПоРемонтам.IDРемонта КАК ID,
	               |	РемонтыСАктамиНарядами.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ РемонтыЗаявокСАктамиНарядами
	               |ИЗ
	               |	РемонтыСАктамиНарядами КАК РемонтыСАктамиНарядами
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК торо_ЗаявкиПоРемонтам
	               |		ПО РемонтыСАктамиНарядами.Регистратор = торо_ЗаявкиПоРемонтам.Регистратор
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонта
	               |ПОМЕСТИТЬ РемонтыПлановыеИДефекты
	               |ИЗ
	               |	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	               |ГДЕ
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот <= &ДатаАктуальности
	               |	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
	               |	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РемонтыПлановыеИДефекты.ID КАК ID,
	               |	РемонтыПлановыеИДефекты.Регистратор КАК Регистратор,
	               |	РемонтыПлановыеИДефекты.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	               |	РемонтыПлановыеИДефекты.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	               |	РемонтыПлановыеИДефекты.ОбъектРемонта КАК ОбъектРемонта,
	               |	РемонтыПлановыеИДефекты.ВидРемонта КАК ВидРемонта
	               |ПОМЕСТИТЬ РемонтыПлановыеСПодчиненными
	               |ИЗ
	               |	РемонтыПлановыеИДефекты КАК РемонтыПлановыеИДефекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
	               |		ПО РемонтыПлановыеИДефекты.ID = торо_НарядыПоРемонтам.IDРемонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
	               |		ПО РемонтыПлановыеИДефекты.ID = торо_АктыПоРемонтам.IDРемонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РемонтыЗаявокСАктамиНарядами КАК РемонтыЗаявокСАктамиНарядами
	               |		ПО РемонтыПлановыеИДефекты.ID = РемонтыЗаявокСАктамиНарядами.ID
	               |ГДЕ
	               |	торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	               |	И торо_АктыПоРемонтам.IDРемонта ЕСТЬ NULL
	               |	И РемонтыЗаявокСАктамиНарядами.ID ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	РемонтыПлановыеСПодчиненными.ID КАК ID,
	               |	РемонтыПлановыеСПодчиненными.ОбъектРемонта КАК ОбъектРемонта,
	               |	РемонтыПлановыеСПодчиненными.ВидРемонта КАК ВидРемонта,
	               |	РемонтыПлановыеСПодчиненными.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	               |	РемонтыПлановыеСПодчиненными.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	               |	ВЫБОР
	               |		КОГДА НЕ Заявки.Регистратор ЕСТЬ NULL
	               |				И торо_ОтмененныеЗаявки.Заявка ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЕстьЗаявка,
	               |	Заявки.Регистратор КАК Смета,
	               |	РемонтыПлановыеСПодчиненными.Регистратор КАК Регистратор,
	               |	Константы.торо_ПричинаЗакрытияРемонтов КАК ПричинаЗакрытия,
	               |	Константы.торо_ПричинаЗакрытияЗаявок КАК ПричинаЗакрытияЗаявки,
	               |	Константы.торо_ОтменятьЗакрытиеЗаявок КАК Отменен,
	               |	РемонтыПлановыеСПодчиненными.Регистратор КАК ДокументОснование,
	               |	Заявки.МоментВремени КАК ДатаЗаявки,
	               |	РемонтыПлановыеСПодчиненными.Регистратор.МоментВремени КАК ДатаДокументаОснования
	               |ПОМЕСТИТЬ ТабСДублями
	               |ИЗ
	               |	РемонтыПлановыеСПодчиненными КАК РемонтыПлановыеСПодчиненными
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК Заявки
	               |		ПО РемонтыПлановыеСПодчиненными.ID = Заявки.IDРемонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
	               |		ПО (Заявки.Регистратор = торо_ОтмененныеЗаявки.Заявка)
	               |			И РемонтыПлановыеСПодчиненными.ID = торо_ОтмененныеЗаявки.ИДРемонта,
	               |	Константы КАК Константы
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID,
	               |	Смета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТабСДублями.ID КАК ID,
	               |	ТабСДублями.ОбъектРемонта КАК ОбъектРемонта,
	               |	ТабСДублями.ВидРемонта КАК ВидРемонта,
	               |	ТабСДублями.ЕстьЗаявка КАК ЕстьЗаявка,
	               |	ТабСДублями.Регистратор КАК Регистратор,
	               |	ТабСДублями.ПричинаЗакрытия КАК ПричинаЗакрытия,
	               |	ТабСДублями.ПричинаЗакрытияЗаявки КАК ПричинаЗакрытияЗаявки,
	               |	ТабСДублями.Отменен КАК Отменен,
	               |	ТабСДублями.ДокументОснование КАК ДокументОснование,
	               |	ВЫБОР
	               |		КОГДА ТабСДублями.ЕстьЗаявка
	               |				И ТабСДублями.ДатаЗаявки > ТабСДублями.ДатаДокументаОснования
	               |			ТОГДА Заявки.ДатаНачалаРемонтныхРабот
	               |		ИНАЧЕ ТабСДублями.ДатаНачалаРемонтныхРабот
	               |	КОНЕЦ КАК ДатаНачала,
	               |	ВЫБОР
	               |		КОГДА ТабСДублями.ЕстьЗаявка
	               |				И ТабСДублями.ДатаЗаявки > ТабСДублями.ДатаДокументаОснования
	               |			ТОГДА Заявки.ДатаОкончанияРемонтныхРабот
	               |		ИНАЧЕ ТабСДублями.ДатаОкончанияРемонтныхРабот
	               |	КОНЕЦ КАК ДатаОкончания,
	               |	ВЫБОР
	               |		КОГДА ТабСДублями.ЕстьЗаявка
	               |			ТОГДА ТабСДублями.Смета
	               |		ИНАЧЕ &ПустаяСсылкаНаЗаявку
	               |	КОНЕЦ КАК Заявка
	               |ПОМЕСТИТЬ ПодготовленныеДанные
	               |ИЗ
	               |	ТабСДублями КАК ТабСДублями
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК Заявки
	               |		ПО ТабСДублями.ID = Заявки.IDРемонта
	               |			И ТабСДублями.Смета = Заявки.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ВыявленныеДефекты.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_РазрешенныеДокументы
	               |ИЗ
	               |	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	               |ГДЕ
	               |	торо_ВыявленныеДефекты.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ПодготовленныеДанные.ДокументОснование КАК ДокументОснование
	               |			ИЗ
	               |				ПодготовленныеДанные КАК ПодготовленныеДанные)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	торо_ЗаявкаНаРемонт.Ссылка
	               |ИЗ
	               |	Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	               |ГДЕ
	               |	торо_ЗаявкаНаРемонт.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ПодготовленныеДанные.ДокументОснование КАК ДокументОснование
	               |			ИЗ
	               |				ПодготовленныеДанные КАК ПодготовленныеДанные)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	торо_ПланГрафикРемонта.Ссылка
	               |ИЗ
	               |	Документ.торо_ПланГрафикРемонта КАК торо_ПланГрафикРемонта
	               |ГДЕ
	               |	торо_ПланГрафикРемонта.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ПодготовленныеДанные.ДокументОснование КАК ДокументОснование
	               |			ИЗ
	               |				ПодготовленныеДанные КАК ПодготовленныеДанные)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	торо_ЗакрытиеЗаявокИРемонтов.Ссылка
	               |ИЗ
	               |	Документ.торо_ЗакрытиеЗаявокИРемонтов КАК торо_ЗакрытиеЗаявокИРемонтов
	               |ГДЕ
	               |	торо_ЗакрытиеЗаявокИРемонтов.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ПодготовленныеДанные.ДокументОснование КАК ДокументОснование
	               |			ИЗ
	               |				ПодготовленныеДанные КАК ПодготовленныеДанные)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПодготовленныеДанные.ID КАК ID,
	               |	ПодготовленныеДанные.ОбъектРемонта КАК ОбъектРемонта,
	               |	ПодготовленныеДанные.ВидРемонта КАК ВидРемонта,
	               |	ПодготовленныеДанные.ЕстьЗаявка КАК ЕстьЗаявка,
	               |	ПодготовленныеДанные.Регистратор КАК Регистратор,
	               |	ПодготовленныеДанные.ПричинаЗакрытия КАК ПричинаЗакрытия,
	               |	ПодготовленныеДанные.ПричинаЗакрытияЗаявки КАК ПричинаЗакрытияЗаявки,
	               |	ПодготовленныеДанные.Отменен КАК Отменен,
	               |	ПодготовленныеДанные.ДокументОснование КАК ДокументОснование,
	               |	ПодготовленныеДанные.Заявка КАК Заявка,
	               |	ПодготовленныеДанные.ДатаНачала КАК ДатаНачала,
	               |	ПодготовленныеДанные.ДатаОкончания КАК ДатаОкончания
	               |ПОМЕСТИТЬ ДанныеСДублямиРемонтов
	               |ИЗ
	               |	ПодготовленныеДанные КАК ПодготовленныеДанные
	               |ГДЕ
	               |	ПодготовленныеДанные.ДокументОснование В
	               |			(ВЫБРАТЬ
	               |				ВТ_РазрешенныеДокументы.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТ_РазрешенныеДокументы КАК ВТ_РазрешенныеДокументы)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.ID КАК ID
	               |ПОМЕСТИТЬ ДублиРемонтов
	               |ИЗ
	               |	ДанныеСДублямиРемонтов КАК ВТ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.ID
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(ВТ.ID) > 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_СкользящийПланРаботСрезПоследних.ID_Ремонта КАК ID_Ремонта
	               |ПОМЕСТИТЬ вт_РемонтыИзОбщегоПлана
	               |ИЗ
	               |	РегистрСведений.торо_СкользящийПланРабот.СрезПоследних(
	               |			,
	               |			ID_Ремонта В
	               |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |					ДанныеСДублямиРемонтов.ID КАК ID
	               |				ИЗ
	               |					ДанныеСДублямиРемонтов КАК ДанныеСДублямиРемонтов)) КАК торо_СкользящийПланРаботСрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID_Ремонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.ID КАК ID,
	               |	&&ОтборРемонтов КАК ПодходитПодОтбор,
	               |	ВТ.ОбъектРемонта КАК ОбъектРемонта,
	               |	ВТ.ВидРемонта КАК ВидРемонта,
	               |	ВТ.ЕстьЗаявка КАК ЕстьЗаявка,
	               |	ВТ.Регистратор КАК Регистратор,
	               |	ВТ.ПричинаЗакрытия КАК ПричинаЗакрытия,
	               |	ВТ.ПричинаЗакрытияЗаявки КАК ПричинаЗакрытияЗаявки,
	               |	ВТ.Отменен КАК Отменен,
	               |	ВТ.ДокументОснование КАК ДокументОснование,
	               |	ВТ.Заявка КАК Заявка,
	               |	ВТ.ДатаНачала КАК ДатаНачала,
	               |	ВТ.ДатаОкончания КАК ДатаОкончания,
	               |	ВЫБОР
	               |		КОГДА вт_РемонтыИзОбщегоПлана.ID_Ремонта ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК РемонтВключенВОбщийПлан
	               |ИЗ
	               |	ДанныеСДублямиРемонтов КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДублиРемонтов КАК ДублиРемонтов
	               |		ПО ВТ.ID = ДублиРемонтов.ID
	               |		ЛЕВОЕ СОЕДИНЕНИЕ вт_РемонтыИзОбщегоПлана КАК вт_РемонтыИзОбщегоПлана
	               |		ПО ВТ.ID = вт_РемонтыИзОбщегоПлана.ID_Ремонта
	               |ГДЕ
	               |	(ВТ.ЕстьЗаявка
	               |			ИЛИ ДублиРемонтов.ID ЕСТЬ NULL)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачала";
	
	Запрос.УстановитьПараметр("ДатаАктуальности", Объект.ДатаАктуальности);
	Запрос.УстановитьПараметр("ПустаяСсылкаНаЗаявку", Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка());
	
	Если Не ОтборРемонтов = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&&ОтборРемонтов", "ВЫБОР 
																   |		КОГДА ВТ.ID В (&ОтборРемонтов)
																   |			ТОГДА ИСТИНА
																   |        ИНАЧЕ ЛОЖЬ
																   |	КОНЕЦ");
		Запрос.УстановитьПараметр("ОтборРемонтов", ОтборРемонтов);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&&ОтборРемонтов", "ИСТИНА");
	КонецЕсли; 

	Результат = Запрос.Выполнить();
	
	Объект.ЗакрываемыеРемонты.Очистить();
	Объект.ЗакрываемыеРемонты.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработкуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    МассивНезаполненныхСтрок = ДополнительныеПараметры.МассивНезаполненныхСтрок;
    
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    
    ВыполнитьОбработкуФрагмент(МассивНезаполненныхСтрок);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработкуФрагмент(Знач МассивНезаполненныхСтрок)
    
    Перем ДокументСоздан, Строка;
    
    Для Каждого Строка Из МассивНезаполненныхСтрок Цикл
        ОбрабатываемыеСтроки.Удалить(Строка);
    КонецЦикла;
    
    Если ОбрабатываемыеСтроки.Количество()=0 Тогда
		ТекстСообщения = НСтр("es='Ni para una de las líneas escogidas no es indicado el tipo del tratamiento: ¡la anulación/traslado de la reparación o el cierre de la demanda! ¡El tratamiento no es cumplido!';ru='Ни для одной из выбранных строк не указан вид обработки: отмена/перенос ремонта или закрытие заявки! Обработка не выполнена!';en='No type of processing is indicated for any of the selected lines: cancellation / transfer of repairs or closing of an application! Processing failed!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
        Возврат;
    КонецЕсли;
    
    ДокументСоздан = СоздатьДокументЗакрытияЗаявокНаСервере();
    
    Если ДокументСоздан Тогда
        
        Если НЕ ЗначениеЗаполнено(Владелец) Тогда
            Оповестить("ВыполненПереносРемонтов", ЭтаФорма.КлючУникальности, ЭтаФорма);
        КонецЕсли;
        
    КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СоздатьДокументЗакрытияЗаявокНаСервере()
	
	ТаблицаЗакрываемыхРемонтов = ОбрабатываемыеСтроки.Выгрузить(Новый Структура("Отменен", Истина));
	ТаблицаПеренесенныхРемонтов = ОбрабатываемыеСтроки.Выгрузить(Новый Структура("Перенесен", Истина));
	Для Каждого СтрокаПеренесенных Из ТаблицаПеренесенныхРемонтов Цикл
		СтрокаЗакрываемых = ТаблицаЗакрываемыхРемонтов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗакрываемых,СтрокаПеренесенных);
	КонецЦикла;
	ТаблицаЗакрываемыхЗаявок = ОбрабатываемыеСтроки.Выгрузить(Новый Структура("ЗакрытьЗаявку", Истина), "Заявка, ID, ПричинаЗакрытияЗаявки");
	ТаблицаЗакрываемыхЗаявок.Колонки.ПричинаЗакрытияЗаявки.Имя = "ПричинаЗакрытия";
	ТаблицаЗакрываемыхЗаявок.Колонки.ID.Имя = "ИДРемонта";
	
	ДокументЗакрытиеЗаявокИРемонтов = Документы.торо_ЗакрытиеЗаявокИРемонтов.СоздатьДокумент();
	
	Если ЗначениеЗаполнено(Владелец) Тогда
		ДокументЗакрытиеЗаявокИРемонтов.ППРИнициатор = Владелец;
	КонецЕсли;
	
	ДокументЗакрытиеЗаявокИРемонтов.ЗакрываемыеЗаявки.Загрузить(ТаблицаЗакрываемыхЗаявок);
	ДокументЗакрытиеЗаявокИРемонтов.ЗакрываемыеРемонты.Загрузить(ТаблицаЗакрываемыхРемонтов);
	ДокументЗакрытиеЗаявокИРемонтов.ДатаАктуальности = Объект.ДатаАктуальности;
	ДокументЗакрытиеЗаявокИРемонтов.Дата = ТекущаяДата();
	
	ДокументЗакрытиеЗаявокИРемонтов.Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнаяОрганизация", Истина);
	ДокументЗакрытиеЗаявокИРемонтов.Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойОтветственный", Справочники.Пользователи.ПустаяСсылка());	
	
	ДокументЗакрытиеЗаявокИРемонтов.ДополнительныеСвойства.Вставить("ИзОбработки", Истина);
	Попытка
		
		ДокументЗакрытиеЗаявокИРемонтов.Записать(РежимЗаписиДокумента.Проведение);
		
		мУдаления = Новый Массив;
		Для каждого текСтрока из Объект.ЗакрываемыеРемонты Цикл
			Если текСтрока.Обрабатывать и (текСтрока.Отменен или текСтрока.Перенесен или текСтрока.ЗакрытьЗаявку) тогда
				мУдаления.Добавить(текСтрока);
			КонецЕсли;
		КонецЦикла;
		Для каждого текСтрока из мУдаления Цикл
			Объект.ЗакрываемыеРемонты.Удалить(текСтрока);
		КонецЦикла;
		
		мУдаления.Очистить();
		Для каждого текСтрока из Объект.АварийныеРемонты Цикл
			Если текСтрока.Обрабатывать и (текСтрока.Отменен или текСтрока.ЗакрытьЗаявку) тогда
				мУдаления.Добавить(текСтрока);
			КонецЕсли;
		КонецЦикла;
		Для каждого текСтрока из мУдаления Цикл
			Объект.АварийныеРемонты.Удалить(текСтрока);
		КонецЦикла;
		ЗаполнитьПлановыеРемонтыНаСервере();
		ЗаполнитьАварийныеРемонтыНаСервере();
		Возврат Истина;
		
	Исключение
		ТекстСообщения = НСтр("es='¡No consiguió anotar el documento ""el Cierre de las demandas y las reparaciones""! ';ru='Не удалось записать документ ""Закрытие заявок и ремонтов""! ';en='Failed to write the document ""Closing applications and repairs""! '") + ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ВыполнитьОбработкуНаСервере()
	
	ОбрабатываемыеСтроки.Загрузить(Объект.ЗакрываемыеРемонты.Выгрузить(Новый Структура("Обрабатывать", Истина)));
	
	НовыеДатыЗаполнены = Истина;
	Для Каждого Строка Из ОбрабатываемыеСтроки Цикл
		Если Строка.Перенесен И Не ЗначениеЗаполнено(Строка.НоваяДатаНачала) и Не ЗначениеЗаполнено(Строка.НоваяДатаОкончания) Тогда
			НовыеДатыЗаполнены = Ложь;
			НомерСтроки = ОбрабатываемыеСтроки.Индекс(Строка) + 1;
			ШаблонСообщения = НСтр("es='¡En la línea № %1 no es rellenado el nuevo período de la reparación!';ru='В строке № %1 не заполнен новый период ремонта!';en='In line No.%1 a new repair period is not filled!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ИначеЕсли Строка.Перенесен И (Строка.НоваяДатаНачала > Строка.НоваяДатаОкончания 
			ИЛИ (Не ЗначениеЗаполнено(Строка.НоваяДатаНачала) И ЗначениеЗаполнено(Строка.НоваяДатаОкончания))) Тогда
			НовыеДатыЗаполнены = Ложь;
			НомерСтроки = ОбрабатываемыеСтроки.Индекс(Строка) + 1;
			ШаблонСообщения = НСтр("es='¡En la línea № %1 es incorrectamente rellenado el nuevo período de la reparación!';ru='В строке № %1 неверно заполнен новый период ремонта!';en='In line No.%1, the new repair period is incorrectly filled!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЦикла;
	
	Если не НовыеДатыЗаполнены Тогда
		Возврат Истина;
	КонецЕсли;
	
	ОбрабатываемыеАварийныеРемонты = Объект.АварийныеРемонты.Выгрузить(Новый Структура("Обрабатывать", Истина));
	Для Каждого Строка Из ОбрабатываемыеАварийныеРемонты Цикл
		НовСтрока = ОбрабатываемыеСтроки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
		НовСтрока.Перенесен = Ложь;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытиеЗаявки(ТекДанные)
	Если ТекДанные.Отменен И ТекДанные.ЕстьЗаявка Тогда
		ТекДанные.ЗакрытьЗаявку = Истина;
		ТекДанные.ПричинаЗакрытияЗаявки = ПредопределенноеЗначение("Справочник.торо_ПричиныЗакрытияЗаявок.ОтменаРемонта");
	ИначеЕсли ТекДанные.Свойство("Перенесен", ) И (ТекДанные.Перенесен И ТекДанные.ЕстьЗаявка) Тогда
		ТекДанные.ЗакрытьЗаявку = Истина;
		ТекДанные.ПричинаЗакрытияЗаявки = ПредопределенноеЗначение("Справочник.торо_ПричиныЗакрытияЗаявок.ПереносРемонта");
	ИначеЕсли ТекДанные.ЕстьЗаявка Тогда 
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗакрытиеЗаявкиЗавершение", ЭтотОбъект, Новый Структура("ТекДанные", ТекДанные)), НСтр("es='¿Anular el cierre de la demanda?';ru='Отменить закрытие заявки?';en='Cancel close application?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеЗаявкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекДанные = ДополнительныеПараметры.ТекДанные;	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ТекДанные.ЗакрытьЗаявку = Ложь;
	КонецЕсли;
	
	ТекДанные.ПричинаЗакрытияЗаявки = ПричинаЗакрытияЗаявок;

КонецПроцедуры

#КонецОбласти
